org/org-roam-and-project.org
#+HUGO_BASE_DIR: ../
#+TITLE: Use Org-roam to manage project in an effective way
#+DATE: <2021-06-11 Fri 14:21>
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_TAGS: 
#+HUGO_CATEGORIES: 
#+HUGO_DRAFT: false
* The Note Type of Zettelkasten
- Fleeting Notes
- Literature Notes
- Permanent Notes
- Project Notes
* The Note Type of Your Project
Compare to the note type of [[file:zettelkasten.org][Zettelkasten]], the note type of our project should be
different as project notes/items are normally generated and used as project goes
by, and the notes can be abandoned/archived once the project is over, at least
for most of notes/items.

In this case, we can say most of them are Fleeting Notes, for the notes can be
considered as Literature or Permanent ones, those should be taken carefully to
the personal notebook but not the project notebook.
* The Principles of Project with Org-roam
- One note for one task/activity
- Keep the persons involved in the note
- Remove/archive the note once the task/activity is done

