content/posts/org-roam-and-project.md
+++
title = "Use Org-roam to manage project in an effective way"
date = 2021-06-11T14:21:00+08:00
lastmod = 2021-06-11T16:48:08+08:00
draft = false
+++

## The Note Type of Zettelkasten {#the-note-type-of-zettelkasten}

-   Fleeting Notes
-   Literature Notes
-   Permanent Notes
-   Project Notes


## The Note Type of Your Project {#the-note-type-of-your-project}

Compare to the note type of [Zettelkasten]({{< relref "zettelkasten" >}}), the note type of our project should be
different as project notes/items are normally generated and used as project goes
by, and the notes can be abandoned/archived once the project is over, at least
for most of notes/items.

In this case, we can say most of them are Fleeting Notes, for the notes can be
considered as Literature or Permanent ones, those should be taken carefully to
the personal notebook but not the project notebook.


## The Principles of Project with Org-roam {#the-principles-of-project-with-org-roam}

-   One note for one task/activity
-   Keep the persons involved in the note
-   Remove/archive the note once the task/activity is done
